//
//  Copyright (c) Microsoft Corporation. All rights reserved.
//

SelectAppPrompt = "Select application to wrap:";
SelectProvisioningProfilePrompt = "Select provisioning profile:";
WrappedPackageNamePrompt = "Wrapped package name:";
SelectTestMAMPoliciesPrompt = "Test MAM Policies:";

InputMissingError = "Input or output file, provisioning profile, or certificate name missing.";
ConflictingArgumentsError = "You must specify either an arguments plist file or command line arguments, but not both.";
InvalidCertSelectedError = "You must specify a valid Apple signing certificate.";
InvalidProvisioningProfileError = "You must specify a valid iOS provisioning profile.";
InvalidExtensionProvisioningProfileError = "A specified extension provisioning profile was not valid.";
NotEnoughProvisioningProfiles = "There are more extensions than specified provisioning profiles. Each extension must have a corresponding provisioning profile, or a wildcard profile must be specified.";
ProvisioningProfileMissingForExtensionError = "No provisioning profile found for extension: %@ .  Application Identifiers are case sensitive."; // %@ is a non-localized extension name
InputFileArgumentMissing = "Specify a valid input application name.";
OutputFileArgumentMissing = "Specify a valid output path and application name for the output packaged application. The output app can be of .ipa type only";
ProvisioningProfileArgumentMissing = "Specify a valid input provisioning profile.";
ADALClientArgumentMissing = "You must specify an AAD client identifier if you have also supplied an AAD reply URI.";
ADALReplyUriArgumentMissing = "You must specify an AAD reply URI if you have also supplied an AAD client identifier.";
ADALClientIdBadArgument = "The given AAD client identifier is not a well-formed guid. Specify a valid client identifier.";
InputAppFileNotFoundError = "The input application you specified was not found. Specify a valid input application name and path.";
InputProvisioningFileNotFoundError = "The input provisioning profile file you specified was not found. Specify a valid input provisioning profile file.";
InputHooksOverrideFileNotFoundError = "The input hooks override file you specified was not found. Specify a valid input hooks override file.";
InputTestMAMPoliciesFileNotFoundError = "The input test MAM policies file you specified was not found. Specify a valid input test MAM policies file.";
ExtensionProvisioningProfilesFileNotFoundError = "The specified path for an extension provisioning profile was not found.";
OutputDirectoryNotFoundError = "The output application folder you specified was not found. Specify a valid path to the output application.\nPath specified: %@";
OutputFileNotIpaExtensionError = "Output application does not have .ipa extension.\nPath specified: %@";
TempDirectoryCreationFailedError = "Failed to create temporary directory.";
TempDirectoryExistsError = "Temporary directory %@ already exists. Delete the directory and please try again.";
ExtractingFailedError = "Failed to extract application to temporary directory.";
PayloadDoesNotContainAppError = "Payload does not contain an application.";
CopyFilesToTempDirError = "Failed to copy files to temporary directory.";
CopyAppFilesError = "Failed to copy application files to temporary directory.";
CopyAdalResourceBundleToTempDirError = "Failed to copy ADAL resource bundle to temporary directory.";
CopyIntuneMAMFrameworkToTempDirError = "Failed to copy IntuneMAM framework to temporary directory.";
UpdatePlistError = "Failed to update application property list file.";
UpdateResourcesError = "Failed to update application resources.";
CopyProvisioningProfileError = "Failed to copy provisioning profile.";
CopyHooksOverrideFileError = "Failed to copy hooks override file.";
CopySettingsBundleToTempDirError = "Failed to copy MAM settings bundle.";
SignPackageError = "An invalid signing certificate was specified. Specify a valid Apple signing certificate.";
SignFrameworksError = "The app's Frameworks directory could not be signed. This may be because it contains files whose format was unrecognized, invalid, or unsuitable.";
SignADALError = "Failed to sign ADAL dylib.";
SignAppWrapperDirError = "Failed to sign AppWrapper Directory.";
SignExecutableError = "Failed to sign the app executable.";
SignWrappedAppError = "Failed to sign the wrapped app.";
SignIPAError = "Failed to sign final .ipa file.";
IPACreationError = "Failed to create ipa file.";
CopyIPAToDestinationError = "Failed to copy final .ipa to destination.";
IntunePlistError = "Failed to create Intune property list file.";
ForkError = "Failed to fork process.";
ProcessExitError = "%@ exited with an error.";
ProcessExitedAbnormallyError = "%@ exited abnormally.";
IncompatibleInvalidApplication = "The input application you specified is invalid. Specify a valid application.";
IncompatibleEncrypted = "The input application you specified is encrypted. Specify a valid unencrypted application.";
IncompatibleNotPie = "The input application you specified is is not in a Position Independent Executable(PIE) format. Specify a valid application in PIE format.";
PatchBinaryError = "Failed to patch application executable.";
IsAlreadyWrapped = "The input application you specified has already been packaged. Specify a valid unpackaged application.";
AppIsNotSigned = "The input application you specified is not signed by a certificate issued by Apple. Specify a valid signed application.";
WrongAppFormat = "The input application you specify must be in the .ipa or .app format.";
PrerequisiteMissing = "Missing prerequisite.";
XCodePrereqFailure = "XCode version %@ or greater is required to run this tool.";
OSXPrereqFailure = "OSX Version %@ or greater is required to run this tool.";
WrongHooksOverrideFormat = "The input hooks override file you specified is in incorrect format. Specify a valid .plist format.";
WrongTestMAMPoliciesFormat = "The input test MAM policies file you specified is in incorrect format. Specify a valid .plist format.";
MainBundleIsNotSigned = "Main AppPackager Bundle is not signed. Download a new dmg and repackage.";
ErrorInformation = "Cause of the error to be provided for investigation";
ErrorReadingCertValidationSettings= "Warning: Unable to verify system settings for certificate revocation checks. If you would like to enforce certificate revocation checks, run the following commands - 'defaults write com.apple.security.revocation CRLStyle BestAttempt' and 'defaults write com.apple.security.revocation OCSPStyle BestAttempt' ";
CRLStyleSettingError = "CRLStyle is set to 'None'. Please set this to 'BestAttempt' by running the command 'defaults write com.apple.security.revocation CRLStyle BestAttempt'.";
OCSPStyleSettingError = "OCSPStyle is set to 'None'. Please set this to 'BestAttempt' by running the command 'defaults write com.apple.security.revocation OCSPStyle BestAttempt'.";
FailedToGenerateNewBundleId = "Failed to generate bundle id.";
FailedGenerateEntitlementsFile = "Failed to generate entitlements file.";
CertNotFoundInProvisioningProfileError = "The certificate input you provided does not exist in the provisioning profile. Resubmit with a certificate which exists in the input provisioning profile.";
CertHashMissingWarning = "WARNING : You did not specify a SHA1 certificate hash. Make sure that your packaged application is signed before deploying. Consult documentation on how to sign a packaged application.";
InvalidEntitlementsError = "Failed to parse entitlements generated from the input application.";
EntitlementNotInProvisioningProfile = "Entitlement(s) '%@' are missing in the provisioning profile. Repackage with a provisioning profile which has these entitlements.";
EntitlementsMissingAndRemoved = "Warning: Entitlement(s) '%@' were missing from the provisioning profile and were removed from the application. If the application required these entitlements, its functionality may be reduced.";
InvalidKeychainEntitlementInProvisioningProfile = "A valid keychain-access-group entitlement is missing from the provisioning profile. Repackage with a provisioning profile which has a valid keychain-access-group entitlement.";
MissingEntitlements = "Entitlements are missing in the provisioning profile. Check the logs for more details";
ProvisioningProfileExpired = "The provisioning profile you are using has expired\n";
CopySettingsBundleError = "Failed to copy application's settings bundle.";
ProvisionProfileNotiOS8Compatible = "Warning: The specified provisioning profile does not contain a team identifier and is not compatible with iOS 8.0 and later operating systems. Use a newer provisioning profile if this application will be deployed to iOS 8.0 or later devices.";
CertificateNotiOS8Compatible = "Warning: The specified certificate does not contain a team identifier (i.e. Organization Unit) and is not compatible with iOS 8.0 and later operating systems. Use a newer certificate if this application will be deployed to iOS 8.0 or later devices.";
ApplicationGroupMismatchCountError = "The provisioning profile you are using does not have the required number of application groups in its entitlements. Repackage with a provisioning profile which has the same number or more com.apple.security.application-groups entries as the application.";
ApplicationGroupMappingFailedError = "The com.apple.security.application-groups entitlements in the provisioning profile you are using could not be matched up with the application's app group ids. Repackage with a provisioning profile which has com.apple.security.application-groups entitlements ending with the same string as the application's app group ids.";
DylibInjectionFailure = "Failed to inject IntuneMAM.framework into the app.";
TooManyExtensionProfilesSpecifiedError = "The number of specified extension provisioning profiles cannot exceed the number of extensions";
FailedToExtractEntitlements = "Failed to extract entitlement information from the extensions.";
FailedToGetAppInfoPlist = "Failed to extract Info.plist from the app.";

WrappingSuccess = "The application was successfully packaged.";
InProgressMessage = "Application packaging in progress...";

InputUserMessage = "\nThe Microsoft Intune App Wrapping Tool for iOS provides the ability to extend mobile application management (MAM) to line-of-business apps. The tool is a Mac OS command line application that creates a 'wrapper' around an app. Once an app is processed, you can then change the apps functionality using an Intune mobile application management policy that you configure.\n\nPlease provide the following input for packaging your application:";
UsageMessage = "\n -i \t <Path to the input native iOS application or previously packaged iOS application> \n -o \t <Path to the output application>  \n -p \t <Path to the provisioning profile> \n -c \t (Optional) <SHA1 hash of the certificate> \n -a \t (Optional) <Client ID of the input app if the app uses Azure Active Directory Libraries> \n -r \t (Optional) <Reply URI of the input app if the app uses Azure Active Directory Libraries> \n -e \t (Optional) Remove missing entitlements during packaging. \n -xe \t (Optional) Prints information about the iOS extensions in the app, and what entitlements are required to use them. \n -x \t (Optional) <An array of paths to extension provisioning profiles> \n -v \t (Optional) Output verbose messages to the console. \n -f \t (Optional) <Path to a plist file specifying arguments.> ";
UsageMessageAdditionalDebugOnlyFeatures = " -t \t (Optional) Debug-only: MAM policies file to include in the settings bundle.\n -t-PPE \t (Optional) Debug-only: Log in against PPE (default is PE).";
UsageMessageUsage = "\nUsage:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -i /<path of input app>/<app filename> -o /<path to output folder>/<app filename> -p /<path to provisioning profile> -c <SHA1 hash of the certificate> [-a <client ID of input app>] [-r <reply URI of input app>] [-v] [-e] [-x /<array of extension provisioing profile paths>]\n\nUsage:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -f /<path to an arguments plist file>\n\nUsage:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -xe -i /<path of input app>/<app filename>";
UsageMessageExample = "\nExample:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -i /Users/myadmin/Documents/MyApp.ipa -o /Users/myadmin/Documents/MyApp_Wrapped.ipa -p /Users/myadmin/Documents/My_Provisioning_Profile_.mobileprovision -c \"12 A3 BC 45 D6 7E F8 90 1A 2B 3C DE F4 AB C5 D6 E7 89 0F AB\"\n\nExample:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -f /users/myadmin/Documents/MyApp_Wrapper_Arguments.plist\n\nExample:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -xe -i /Users/myadmin/Documents/MyApp.ipa\n\nExample:\n\n./IntuneMAMPackager/Contents/MacOS/IntuneMAMPackager -i /Users/myadmin/Documents/MyExtensionApp.ipa -o /Users/myadmin/Documents/MyExtensionApp_Wrapped.ipa -p /Users/myadmin/Documents/My_Provisioning_Profile_.mobileprovision -c \"12 A3 BC 45 D6 7E F8 90 1A 2B 3C DE F4 AB C5 D6 E7 89 0F AB\" -x \\<array\\>\\<string\\>/Users/myadmin/Documents/My_Share_Extension.mobileprovision\\</string\\>\\<string\\>/Users/myadmin/Documents/My_Document_Provider_Extension.mobileprovision\\</string\\>\\</array\\>";

ExtensionInfoMessage = "\nPlease ensure that the supplied provisioning profiles match these extensions and contain these entitlements at minimum\nThe specified app contains the following extensions:\n";
ExtensionInfoMessageNoExtensions = "\nThe specified app does not contain any extensions.";
ExtensionDescriptorName = "\nExtension Suffix: %@"; // %@ will be the name of an extension which will not be localized
ExtensionDescriptorEntitlements = "Entitlements: %@"; // %@ will be a list of entitlements which cannot be localized
ExtensionDescriptionDoneMessage = "The app's extensions have been analyzed";

OutputPackageNameAppend = "_Restricted";
AppPackagerTitle = "\nMicrosoft Intune App Wrapping Tool for iOS";
AppPackagerVersion = "Version:%@";
AppPackagerCopyrightString = "Copyright 2014 Microsoft Corporation";
AppPackagerParametersString = "Input Parameters\n Path to input application:\t\t%@\n Path to output application:\t%@\n Provisioning profile:\t\t\t%@\n SHA1 Hash of certificate:\t\t%@";
AppMigrationFailed = "Failed to migrate wrapped application to latest format.";
AppRestoreFailed = "Failed to restore previously wrapped application contents.";
InvalidAppXCodeVersion = "The input app was built with an unsupported xcode version.";

// Verbose messages:
MacOSXVersion = "Version of MACOSX is %@"; // %@ will be the version string which should not be localized.
XcodeVersionCheckFailed = "XCode prerequisite version check failed: failure in executing the xcodebuild command.";
XcodeVersionInstalled = "Version of XCode installed is %@"; // %@ is version string which should not get localized.
DefaultsFailed = "Execution of defaults failed with error: %@."; // %@ will be the error description that the defaults process returns.
CopyFailed = "Could not copy file in directory: %@"; // %@ is directory path which is not localized.
XcodeSelectFailed = "Execution of xcode-select failed.";
SecCertificateCopyValuesFailed = "SecCertificateCopyValues in isSigningCertificateIssuedByApple failed with error: %@"; // %@ is the error description given by Apple.
DevNullOpenError = "Error opening /dev/null";
PipeFailed = "Pipe operation failed";
NonblockingOnReadFDFailed = "Unable to set non-blocking for read file descriptor.";
WaitFailed = "Wait on child process failed.";
PackagerUpgradeScenario = "Packaging a previously packaged application with a newer version of the packager.";
PackagerComponentConversion = "Packager Version: %@, App Version: %@, Concatenated Version: %@"; // The %@'s correspond to the version numbers and should not be localized.